{
    "title": "Stacked Sparkline",
    "segments": [
        [
            {"description": "You can create a stacked sparkline by using the StackedSparkline function in a formula: <b>=STACKEDSPARKLINE(points, colorRange?, labelRange?, maximum?, targetRed?, targetGreen?, targetBlue?, tragetYellow?, color?, highlightPosition?, vertical?, textOrientation?, textSize?)</b>."},
			{"description": "The function has the following parameters:"},
            {"description": "<b>points</b>: Reference that represents the range of cells containing all the values to be described, such as \"A1:A4\". "},
            {"description": "<b>colorRange</b>: (optional) Reference that represents the range of cells containing all the colors, such as \"B1:B4\"; default value is generated by color."},
            {"description": "<b>labelRange</b>: (optional) Reference that represents the range of cells containing all the labels, such as \"C1:C4\"; default value is empty string."},
            {"description": "<b>maximum</b>: (optional) Number that represents the maximum value of the sparkline; default value is the summary of all positive values."},
            {"description": "<b>targetRed</b>: (optional) Number that represents the location of the red line; default value is empty string."},
            {"description": "<b>targetGreen</b>: (optional) Number that represents the location of the green line; default value is empty string."},
            {"description": "<b>targetBlue</b>: (optional) Number that represents the location of the blue line; default value is empty string."},
            {"description": "<b>targetYellow</b>: (optional) Number that represents the location of the yellow line; default value is empty string."},
            {"description": "<b>color</b>: (optional) A string that represents the color for generating colors if colorRange is omitted; default value is \"#646464\"."},
            {"description": "<b>highlightPosition</b>: (optional) Number that represents the index of the highlight area; default value is empty string."},
            {"description": "<b>vertical</b>: (optional) Boolean that represents whether to display the sparkline vertically or not; default value is false."},
            {"description": "<b>textOrientation</b>: (optional) Number that represents the orientation of the label text. One of the following:"},
            {"list": [
                 "0: (default) Horizontal",
                 "1: Vertical"
            ]},
            {"description": "<b>textSize</b>: (optional) Number that represents the size (in px) of the label text; default value is 10."}
        ]
    ]
}
